// Задача 2: Напишите программу, которая на вход 
//принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 5; b = 7 -> max = 7
//a = 2 b = 10 -> max = 10
//a = -9 b = -3 -> max = -3

/*Console.WriteLine("Enter first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter second number: ");
int b = Convert.ToInt32(Console.ReadLine());

if (a > b) 
{
    Console.WriteLine("max = " + a);
    Console.WriteLine("min = " + b);
}
else
{
    if (a == b)
    {
       Console.WriteLine(a + " = " + b); 
    }
    else
    {
        Console.WriteLine("max = " + b);
        Console.WriteLine("min = " + a);
    }
}
*/

//Задача 4: Напишите программу, которая принимает на вход три 
//числа и выдаёт максимальное из этих чисел.
//2, 3, 7 -> 7
//44 5 78 -> 78
//22 3 9 -> 22

Console.WriteLine("Enter first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter second number: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter third number: ");
int c = Convert.ToInt32(Console.ReadLine());

int count = 0; 
int max = a;

while (count < 3)
{
if
}