//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
//и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// int getDegreeAtoB (int a, int b){

//     int degree = 1;
//     for (int count = 1; count <= b; count++){

//         degree = degree*a;
//     }
//     return degree;    
// }

// Console.WriteLine ("Введите первое число: ");
// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine ("Введите второе число: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if (num2 < 0 ){
//     Console.WriteLine ("Второе число должно быть положительным!");

// }
// else{
// Console.WriteLine (getDegreeAtoB(num1, num2));

// }


